app/controllers/registrar_periodo_controller.rb

SELECT * FROM "users" LIMIT 1
---
  def checkin
    hora = Time.now
    user = User.first