app/controllers/relatorio_horas_controller.rb

SELECT * FROM "periodos" WHERE ("periodos"."date" = '2010-09-05') ORDER BY periodos.id DESC LIMIT 1
INSERT INTO "periodos" ("tipo", "created_at", "updated_at", "date", "user_id", "checkin", "checkout") VALUES(NULL, '2010-09-05 02:12:31.544530', '2010-09-05 02:12:31.544530', '2010-01-01 00:00:00.000000', 1, '2010-01-01 08:00:00.000000', '2010-01-01 12:00:00.000000') RETURNING "id"
---
  def visualizar
    @horas = Periodo.find (:all, :order =>'date')
    @semanas = {}
    @horas.each do |hora|
      data_inicio = hora.date.at_beginning_of_week;
      data_fim = hora.date.at_end_of_week
      semanaHash = obter_semana data_inicio, data_fim
      semanaHash[:periodos].push hora